In [1]:
import numpy as np
import pandas as pd

In [3]:
np.random.seed(101)
arr=np.random.randn(4,4).round(2)
arr

array([[ 2.71,  0.63,  0.91,  0.5 ],
       [ 0.65, -0.32, -0.85,  0.61],
       [-2.02,  0.74,  0.53, -0.59],
       [ 0.19, -0.76, -0.93,  0.96]])

In [12]:
df=pd.DataFrame(arr,columns='W X Y Z'.split(),\
               index=['India','US','Japan','Germany']
               )
df

            W     X     Y     Z
India    2.71  0.63  0.91  0.50
US       0.65 -0.32 -0.85  0.61
Japan   -2.02  0.74  0.53 -0.59
Germany  0.19 -0.76 -0.93  0.96

In [9]:
df.reset_index(drop=False,inplace=False)

   level_0    index     W     X     Y     Z
0        0    India  2.71  0.63  0.91  0.50
1        1       US  0.65 -0.32 -0.85  0.61
2        2    Japan -2.02  0.74  0.53 -0.59
3        3  Germany  0.19 -0.76 -0.93  0.96

In [13]:
#Step 1
df.reset_index(drop=True,inplace=True)

In [14]:
df

      W     X     Y     Z
0  2.71  0.63  0.91  0.50
1  0.65 -0.32 -0.85  0.61
2 -2.02  0.74  0.53 -0.59
3  0.19 -0.76 -0.93  0.96

In [25]:
#Step 2
df['States']=['Maha','Mp','Ap','Up']
df

      W     X     Y     Z States
0  2.71  0.63  0.91  0.50   Maha
1  0.65 -0.32 -0.85  0.61     Mp
2 -2.02  0.74  0.53 -0.59     Ap
3  0.19 -0.76 -0.93  0.96     Up

In [26]:
df1=df.copy()

## drop is for the new col to be added/set
## append refers to the original indices(row labels)

In [27]:
df1.set_index('States',drop=True,append=False,inplace=False)

           W     X     Y     Z
States
Maha    2.71  0.63  0.91  0.50
Mp      0.65 -0.32 -0.85  0.61
Ap     -2.02  0.74  0.53 -0.59
Up      0.19 -0.76 -0.93  0.96

In [18]:
df1.set_index('States',drop=True,append=True,inplace=False)

             W     X     Y     Z
  States
0 Maha    2.71  0.63  0.91  0.50
1 Mp      0.65 -0.32 -0.85  0.61
2 Ap     -2.02  0.74  0.53 -0.59
3 Up      0.19 -0.76 -0.93  0.96

In [28]:
#Step 3
df1.set_index('States',drop=True,append=False,inplace=True)

In [29]:
df1.shape

(4, 4)

In [30]:
df1

           W     X     Y     Z
States
Maha    2.71  0.63  0.91  0.50
Mp      0.65 -0.32 -0.85  0.61
Ap     -2.02  0.74  0.53 -0.59
Up      0.19 -0.76 -0.93  0.96

In [31]:
df1.index #if append=true than two indexes

Index(['Maha', 'Mp', 'Ap', 'Up'], dtype='object', name='States')

In [34]:
df1.rename({'Z':'Zelius','Y':'Yolo'},axis=1)#Searching in columns so axis=1.For rows use axis=0

           W     X  Yolo  Zelius
States
Maha    2.71  0.63  0.91    0.50
Mp      0.65 -0.32 -0.85    0.61
Ap     -2.02  0.74  0.53   -0.59
Up      0.19 -0.76 -0.93    0.96

In [35]:
d1 = {'A':[np.nan,2,4],'B':[np.nan,np.nan,np.nan],'C':[2,np.nan,np.nan]}#Keys become the column labels
df1=pd.DataFrame(d1)
df1

     A   B    C
0  NaN NaN  2.0
1  2.0 NaN  NaN
2  4.0 NaN  NaN

In [39]:
df1.dropna(axis=1)
df1.dropna(axis=1,how='any')#If any value nan in a column drop it

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [38]:
df1.dropna(axis=1,how='all')#Only drop where all rows are nan in a column

     A    C
0  NaN  2.0
1  2.0  NaN
2  4.0  NaN

In [40]:
df1.dropna(axis=0,how='any')#Extreme will drop all maybe

Empty DataFrame
Columns: [A, B, C]
Index: []

In [42]:
df1.dropna(axis=0,how='all')#Very linient because a complete row can't have all null values

     A   B    C
0  NaN NaN  2.0
1  2.0 NaN  NaN
2  4.0 NaN  NaN

In [46]:
df1.dropna(axis=1,how='any',thresh=2)#thresh is related to not null values and this function retains

     A
0  NaN
1  2.0
2  4.0

In [47]:
df1.fillna('Hello World')

             A            B            C
0  Hello World  Hello World            2
1            2  Hello World  Hello World
2            4  Hello World  Hello World

In [48]:
df1['B'].fillna('Hello World',inplace=True)
df1

     A            B    C
0  NaN  Hello World  2.0
1  2.0  Hello World  NaN
2  4.0  Hello World  NaN

In [50]:
pd.__version__,np.__version__

('1.0.1', '1.18.1')

In [51]:
df1.describe()

              A    C
count  2.000000  1.0
mean   3.000000  2.0
std    1.414214  NaN
min    2.000000  2.0
25%    2.500000  2.0
50%    3.000000  2.0
75%    3.500000  2.0
max    4.000000  2.0

In [55]:
df1['A'].fillna(value=df1['A'].mean(),inplace=True)

In [56]:
df1

     A            B    C
0  3.0  Hello World  2.0
1  2.0  Hello World  NaN
2  4.0  Hello World  NaN

In [127]:
df1=pd.read_excel(r'C:\Users\ayush\Python\NaTrial.xlsx')    
df1

   A     B     C     D
0  2  20.0   NaN   NaN
1  3   NaN   NaN    30
2  4   NaN   xyz    40
3  5  50.0  n.a.  N.A.

In [64]:
#Yellow color in excel sheet are taken as NAN and green values are unchanged or are retained.

In [65]:
df1

   A     B     C     D
0  2  20.0   NaN   NaN
1  3   NaN   NaN    30
2  4   NaN    na    40
3  5  50.0  n.a.  N.A.

In [86]:
df1=pd.read_excel(r'C:\Users\ayush\Python\NaTrial.xlsx',na_values=['xyz','n.a.','N.A.'],keep_default_na=False)
df1

   A   B    C    D
0  2  20  N/A  n/a
1  3       NA   30
2  4      NaN   40
3  5  50  NaN  NaN

In [87]:
type(df1['B'][1])

str

In [88]:
df1=pd.read_excel(r'C:\Users\ayush\Python\NaTrial.xlsx',na_values=['xyz','n.a.','N.A.'],keep_default_na=True)   #shift+quick 3 tab clicks

In [89]:
df1

   A     B   C     D
0  2  20.0 NaN   NaN
1  3   NaN NaN  30.0
2  4   NaN NaN  40.0
3  5  50.0 NaN   NaN

In [84]:
type(df1['B'][1])

numpy.float64

In [96]:
import pandas as pd
train=pd.read_csv(r'C:/Users/ayush/titanic_train.csv')
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [97]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [98]:
train[train['Name']=='Williams, Mr. Charles Eugene']

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0,NaN,S

In [99]:
train[train['Name']=='Spencer, Mrs. William Augustus (Marie Eugenie)']

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
31,32,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,NaN,1,0,PC 17569,146.5208,B78,C

In [111]:
train["Age1"] = train.groupby('Pclass')['Age'].transform(lambda x: x.fillna(x.mean()))

In [112]:
train[train['Name']=='Williams, Mr. Charles Eugene']

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age1
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0,NaN,S,29.87763

In [123]:
train[train['Name']=='Williams, Mr. Charles Eugene']

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age1
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0,NaN,S,29.87763

In [118]:
train.groupby(by='Pclass')['Age'].mean()

Pclass
1    38.233441
2    29.877630
3    25.140620
Name: Age, dtype: float64

In [124]:
train["Age1"] = train.groupby('Pclass')['Age'].transform(lambda x: x.fillna(x.mean()))

In [125]:
by_pclass=train.groupby('Pclass')
type(by_pclass)

pandas.core.groupby.generic.DataFrameGroupBy

In [ ]:
#forward filled
#backward filled
#tshift